Repository: casspangell/LPH-Mobile-App-iOS-Ron
Catalog: LovePeaceHarmony/*.lproj/Localizable.strings
Languages: de, es, fr, nl

source: Connect with Apple
fr: Connectez-vous avec Apple

source: Connect with Google
de: Verbinden mit Google
es: Conéctate a Google
fr: Connectez-vous avec Google
nl: Verbinden met Google

source: Connect with Facebook
de: Verbinden mit Facebook
es: Conéctate a Facebook
fr: Connectez-vous avec Facebook
nl: Verbinden met Facebook

source: Login
de: Anmelden
es: Inicio de Sesión
fr: Connexion
nl: Inloggen

source: Don't have an account? Sign Up
de: Sie haben keinen Account? Hier Anmelden
es: ¿No tiene una cuenta? Regístrese
fr: Vous n'avez pas de compte ? Inscrivez-vous
nl: Heb je geen account? Meld je aan

source: Password
de: Passwort
es: Contraseña
fr: Mot de Passe
nl: Wachtwoord

source: email/password can't be empty
de: Email/Passwort darf nicht leer sein
es: El correo electrónico/contraseña no puede estar vacío
fr: L'adresse électronique et le mot de passe ne peuvent être vides
nl: E-mail / wachtwoord moet worden ingevuld

source: Please check your internet connection
de: Bitte prüfen sie ihre Internetverbindung
es: Compruebe su conexión a Internet
fr: Veuillez vérifier votre connexion Internet
nl: Check alsjeblieft je internetverbinding

source: Tap anywhere to continue
de: Tippen sie an beliebiger Stelle um fortzufahren
es: Pulse en cualquier lugar para continuar
fr: Tapez n'importe où pour continuer.
nl: Klik op een willekeurige plek om door te gaan

source: Confirm Password
de: Passwort Bestätigen
es: Confirme la Contraseña
fr: Confirmez le mot de Passea
nl: Bevestig Wachtwoord

source: Back
de: Zurück
es: Volver
fr: Retour
nl: Terug

source: Create an Account
de: Account Erstellen
es: Crea una Cuenta
fr: Créez un Compte
nl: Maak een account aan

source: Submit
de: Absenden
es: Enviar
fr: Soumettre
nl: Verzenden

source: Chant Now
de: Jetzt Singen
es: Cantar Ahora
fr: Chanter Maintenant
nl: Chant Nu

source: Reminders
de: Erinnerungen
es: Recordatorios
fr: Rappels
nl: Herinnering

source: Milestones
de: Meilensteine
es: Hitos
fr: Objectifs
nl: Mijlpalen

source: Chanting for World Peace
es: Cantar por la Paz Mundial
fr: Chanter pour la paix dans le monde

source: Chant
de: Singen
es: Cantar
fr: Chantez
nl: Chanten

source: Shuffle Turned On
de: Zufallswiedergabe Aktiviert
es: Aleatorio Activado
fr: Lecture Aléatoire Activée
nl: Willekeurig Afspelen Aan

source: Shuffle Turned Off
de: Zufallswiedergabe Deaktiviert
es: Aleatorio Desactivado
fr: Lecture Aléatoire Désactivée
nl: Willekeurig Afspelen Uit

source: Repeat Turned Off
de: Wiederholung Deaktiviert
es: Repetición Desactivada
fr: Répétition Activée
nl: Herhalen Uit

source: Repeat Turned On
de: Wiederholung Aktiviert
es: Repetición Activado
fr: Répétition Désactivée
nl: Herhalen Aan

source: Chant any time
de: Jederzeit singen
es: Canta en cualquier momento
fr: Chanter en tout temps
nl: Chanten op elk moment

source: Set reminders to chant
de: Erinnerungen setzen zum Singen
es: Establecer recordatorios para cantar
fr: Ajouter un rappel pour chanter
nl: Stel herinneringsmeldingen in om te chanten

source: View your milestones
de: Meilensteine ansehen
es: Ver tus hitos
fr: Visualisez vos objectifs
nl: Bekijk je mijlpalen

source: Every Day
de: Täglich
es: Todos los Días
fr: Tous les Jours
nl: Elke Dag

source: Off
de: Aus
es: Apagado
fr: Arrêt
nl: Uit

source: Sun
de: So
es: Dom
fr: Dim
nl: Zondag

source: Mon
de: Mo
es: Lun
fr: Lun
nl: Maandag

source: Tue
de: Di
es: Mar
fr: Mar
nl: Dinsdag

source: Wed
de: Mi
es: Mier
fr: Mer
nl: Woensdag

source: Thu
de: Do
es: Jue
fr: Jeu
nl: Donderdag

source: Fri
de: Fr
es: Vier
fr: Ven
nl: Vrijdag

source: Sat
de: Sa
es: Sab
fr: Sam
nl: Zaterdag

source: Turn on / off chants
de: Singen an / abschalten
es: Activar/desactivar cantos
fr: Activer/arrêter le chant
nl: Zet chanten aan / uit

source: Use the switches to customize your chanting playlist.
de: Nutze die Schalter um die Sing Playliste anzupassen.
es: Utiliza los botones para personalizar tu lista de reproducción de cantos.
fr: Utilisez les boutons pour personaliser votre liste de lecture.
nl: Gebruik de schakelaars om je chantafspeellijst aan te passen.

source: Now Playing:
es: Reproduciendo ahora:
fr: En Lecture:

source: Mandarin, Soul Language, English
de: Mandarin, Seelensprache und Englisch
es: Mandarín, Lenguaje del Alma, Inglés
fr: Mandarin, Langage de L'âme, Anglais
nl: Mandarijn, Zielentaal en Engels

source: Hindi, Soul Language, English
de: Hindi, Seelensprache, Englisch
es: Hindi, Lenguaje del Alma, Inglés
fr: Hindi, Langage de l'äme, Anglais
nl: Hindi, Zielentaal, Engels

source: German, English, Mandarin
de: Deutsch, Englisch, Mandarin
es: Alemán, Mandarín, Inglés
fr: Allemand, Anglais, Mandarín
nl: Duits, Mandarijn, Engels

source: Spanish, Soul Language
de: Spanisch, Seelensprache
es: Español, Lenguaje del Alma
fr: Espagnol, Langage de l'äme
nl: Spaans, Zielentaal

source: Soul Language, French
de: Seelensprache, Französisch
es: Lenguaje del Alma, Francès
fr: Langage de l'äme, Français
nl: Zielentaal, Frans

source: Soul Language, French, Creole
de: Seelensprache, Französisch, Kreolisch
es: Lenguaje del Alma, Francès, Criollo
fr: Langage de l'äme, Français, Créole
nl: Zielentaal, Frans, Creools

source: Aloha, Maluhia, Lokahi (LPH in Hawaiian)
de: Aloha, Maluhai, Lokahi (LPH in Hawaiianisch)
es: Aloha, Maluhai, Lokahi (LPH en Hawaiano)
fr: Aloha, Maluhai, Lokahi (APH en Hawaîen)
nl: Aloha, Maluhai, Lokahi (LPH in Hawaiaans)

source: Lu La Li Version, English and Hawaiian
de: Lu La Li Version, Englisch und Hawaiianisch
es: Versión de Lu La Li, en Inglés y Hawaiano
fr: Version de Lu La Li, en Anglais et Hawaien
nl: Lu La Li versie, Engels en Hawaiaans

source: Love Peace Harmony in English
de: Love Peace Harmony in Englisch
es: Amor Paz Armonía en Inglés
fr: Amour Paix Harmonie en Anglais
nl: Love Peace Harmony in het Engels

source: Love Peace Harmony in Many Languages
es: Amor Paz Armonía en Muchos Idiomas
fr: Amour Paix Harmonie dans de Nombreuses Langues
nl: Liefde, Vrede en Harmonie in Veel Talen

source: Expressions of Love Peace Harmony
es: Expresiones de Amor Paz Armonía
fr: Expressions d'Amour Paix Harmonie
nl: Uitingen van Liefde, Vrede en Harmonie

source: Days Straight
de: Tage lang gesungen
es: Días Seguidos
fr: Jours d'affilée
nl: Dagen achtereen gechant

source: You have chanted for a total of:
de: Sie haben insgesamt:
es: Has cantado durante un total de:
fr: Vous avez chanté pour un total de:
nl: In totaal heb je gechant:

source: Days
de: Tage
es: Días
fr: Jours
nl: Dagen

source: Longest streak:
de: Längster Beitrag:
es: La racha más larga:
fr: La plus longue série:
nl: Langste aaneengesloten tijd:

source: Do you want to reset all your milestones?
de: Wollen Sie all ihre Meilensteine zurücksetzen?
es: ¿Quieres reiniciar todos tus hitos?
fr: Voulez-vous réinitialiser tous vos objectifs ?
nl: Wil je al je mijlpalen opnieuw instellen?

source: Milestone Data Deleted
de: Meilensteine Gelöscht
es: Datos de hitos borrados
fr: Données d'objectifs supprimées
nl: Mijlpaalgegevens verwijderd

source: Erase Milestones
de: Meilensteine Löschen
es: Borrar Hitos
fr: Effacer les Objectifs
nl: Verwijder Mijlpalen

source: On
de: An
es: Encendido
fr: Activé

source: No reminder added
de: Keine Erinnerung hinzugefügt
es: No se ha añadido ningún recordatorio
fr: Aucun Rappel Ajouté
nl: Geen herinneringsmelding toegevoegd

source: Repeat
de: Wiederholen
es: Repetir
fr: Répéter
nl: Herhalen

source: Default
de: Standard
es: Por Defecto
fr: Défaut
nl: Standaardinstelling

source: Delete Reminder
de: Erinnerung löschen
es: Borrar Recordatorio
fr: Supprimer le Rappel
nl: Verwijder herinneringsmelding

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
nl: Annuleren

source: Save
de: Speichern
es: Guardar
fr: Sauvegarder
nl: Opslaan

source: Edit Reminder
de: Erinnerung ändern
es: Editar Recordatorio
fr: Modifier le Rappel
nl: Herinneringsmelding bewerken

source: Sound
de: Klang
es: Sonido
fr: Son
nl: Geluid

source: Alarm already added for this time!
de: Alarm bereits für diese Uhrzeit hinzugefügt!
es: ¡Alarma ya añadida para este tiempo!
fr: Alarme déjà ajoutée pour cette heure !
nl: Alarm al toegevoegd voor deze periode!

source: Do you want to delete the alarm?
de: Wollen Sie den Alarm löschen?
es: ¿Quieres eliminar la alarma?
fr: Voulez-vous supprimer l'alarme?
nl: Wil je het alarm verwijderen?

source: Maximum number of reminders reached
de: Maximale Anzahl von Erinnerungen erreicht
es: Número máximo de recordatorios alcanzado
fr: Nombre maximal de rappels atteint
nl: Maximaal aantal herinneringsmeldingen bereikt

source: Repeats
de: Wiederholungen
es: Repetir
fr: Répétition
nl: Herhalingen

source: Repeat - Off
de: Wiederholen - Aus
es: Repetir - Desactivado
fr: Répétition - Off
nl: Herhalen - Uit

source: Done
de: Fertig
es: Hecho
fr: Fait
nl: Gereed

source: Select Repeat
de: Wiederholen Wählen
es: Seleccionar Repetir
fr: Sélectionnez Répéter
nl: Selecteer herhalen

source: Everyday
de: Täglich
es: Todos los días
fr: Tous les jours
nl: Elke dag

source: Sunday
de: Sonntag
es: Domingo
fr: Dimanche
nl: Zondag

source: Monday
de: Montag
es: Lunes
fr: Lundi
nl: Maandag

source: Tuesday
de: Dienstag
es: Martes
fr: Mardi
nl: Dinsdag

source: Wednesday
de: Mittwoch
es: Miércoles
fr: Mercredi
nl: Woensdag

source: Thursday
de: Donnerstag
es: Jueves
fr: Jeudi
nl: Donderdag

source: Friday
de: Freitag
es: Viernes
fr: Vendredi
nl: Vrijdag

source: Saturday
de: Samstag
es: Sábado
fr: Samedi
nl: Zaterdag

source: News
de: Neues
es: Noticias
fr: Nouvelles
nl: Nieuwsberichten

source: The Song
de: Das Lied
es: El Canto
fr: Le Chant
nl: De Song

source: The Movement
de: Die Bewegung
es: El Movimiento
fr: Le Mouvement
nl: De Beweging

source: Master Sha
es: Maestro Sha
fr: Maître Sha

source: Visit Our Website
de: Besuchen sie unsere Webseite
es: Visite Nuestro Sitio Web
fr: Visitez Notre Site Web
nl: Bezoek onze Website

source: Donate Now
de: Jetzt Spenden
es: Done Ahora
fr: Donnez Maintenant
nl: Doneer Nu

source: About
de: Über
es: Acerca de
fr: À Propos De
nl: Over

source: Logout
de: Abmelden
es: Cierre de sesión
fr: Déconnexion
nl: Uitloggen

source: Love Peace Harmony Messenger
fr: Messager d'Amour Paix Harmonie

source: Alert
de: Alarm
es: Alerta
fr: Alerte
nl: Waarschuwingsmelding

source: It's time to chant!!!
de: Es ist Zeit zu singen!!!
es: ¡¡Es hora de cantar!!
fr: Il est temps de chanter !!!
nl: En nu gaan we chanten!!!

source: Please check your internet connection!
de: Bitte prüfen sie ihre Internetverbindung!
es: Compruebe su conexión a Internet
fr: Veuillez vérifier votre connexion Internet !

source: Something went wrong, please try again
de: Etwas ging schief, bitte versuchen sie es erneut
es: Algo ha ido mal, por favor, inténtelo de nuevo
fr: Quelque chose s'est produit, veuillez réessayer

source: Please enter your name
de: Bitte geben Sie ihren Namen ein
es: Por favor, introduce tu nombre
fr: Veuillez saisir votre nom

source: Invalid email address
de: Ungültige Mailadresse
es: Dirección de correo electrónico inválida
fr: Adresse électronique non valide

source: Please enter your password
de: Bitte geben Sie ihr Passwort ein
es: Introduce tu contraseña
fr: Veuillez entrer votre mot de passe

source: Password needs to be at least 6 characters
de: Das Passwort muss mindestens 6 Zeichen lang sein
es: La contraseña debe tener al menos 6 caracteres
fr: Le mot de passe doit être composé d'au moins 6 caractères

source: Please enter confirmation password
de: Bitte bestätigen sie ihr Passwort
es: Por favor, introduzca la contraseña de confirmación
fr: Veuillez entrer le mot de passe de confirmation

source: Passwords do not match
de: Die Passwörter stimmen nicht überein
es: Las contraseñas no coinciden
fr: Les mots de passe ne correspondent pas

source: Please enable your song & play
de: Bitte schalten sie Singen & Spielen an
es: Por favor, active su canción y juegue.
fr: Veuillez activer votre chanson et la faire jouer

source: Shuffle turned on
de: Zufallswiedergabe aktiviert
es: Aleatorio activado
fr: Lecture aléatoire activée

source: Shuffle turned off
de: Zufallswiedergabe deaktiviert
es: Aleatorio desactivado
fr: Lecture aléatoire désactivée

source: Repeat turned on
de: Wiederholung aktiviert
es: Repetición activada
fr: Répétition activée

source: Repeat turned off
de: Wiederholung deaktiviert
es: Repetición desactivada
fr: Répétition désactivée

source: No previous song
de: Kein vorheriges Lied
es: Ninguna canción anterior
fr: Aucune chanson précédente

source: No next song
de: Kein nächstes Lied
es: No hay siguiente canción
fr: Pas de chanson suivante

source: Join together with 1.5 billion people to chant Love, Peace and Harmony by 2030.
de: Vereinen wir 1,5 Milliarden Menschen bis 2030, um mit ihnen Liebe, Frieden und Harmonie zu singen.
es: Únanse a 1.500 millones de personas para cantar Amor, Paz y Armonía para el 2030.
fr: Joignez-vous à 1,5 milliard de personnes pour chanter Amour, Paix et Harmonie d’ici 2030.
nl: Kom samen met 1,5 miljard mensen om Liefde, Vrede en Harmonie te zingen in 2030.

source: When many people join hearts and souls together to chant and meditate, this automatically creates a powerful field. We become what we chant, so as we chant to create world love, peace and harmony, each of us is transforming the message we carry within.
de: Wenn viele Menschen Herzen und Seelen vereinen, gemeinsam chanten und meditieren, entsteht automatisch ein kraftvolles Feld. Wir werden zu dem, was wir chanten. Chanten wir also für Liebe, Frieden und Harmonie auf der Welt, transformieren wir die Botschaften, die wir in uns tragen.
es: Cuando muchas personas unen sus corazones y almas para cantar y meditar, esto crea automáticamente un campo poderoso. Nos convertimos en lo que cantamos, así que mientras cantamos para crear amor, paz y armonía mundial, cada uno de nosotros está transformando el mensaje que llevamos dentro.
fr: Lorsque de nombreuses personnes unissent leurs cœurs et leurs âmes pour chanter et méditer, cela crée automatiquement un champ puissant. Nous devenons ce que nous chantons, de sorte que lorsque nous chantons pour créer l’amour, la paix et l’harmonie dans le monde, chacun d’entre nous transforme le message qu’il porte en lui.
nl: Wanneer veel mensen harten en zielen verenigen om te zingen en te mediteren, creëert dit automatisch een krachtig veld. We worden wat we zingen, dus als we zingen om wereldliefde, vrede en harmonie te creëren, transformeert ieder van ons de boodschap die we in ons dragen.

source: Love, Peace and Harmony, a song received by Dr. and Master Sha from the Divine, carries the high frequency and vibration of love, forgiveness, compassion and light. Your body naturally resonates with this elevated frequency, and responds by activating love, peace and harmony throughout your being.
de: Liebe, Frieden und Harmonie ist ein Lied, das Dr. und Master Zhi Gang Sha vom Göttlichen erhalten hat. Es trägt die hohe Frequenz und Schwingung von Liebe, Vergebung, Mitgefühl und Licht. Unser Körper geht ganz natürlich in Resonanz mit dieser erhebenden Schwingung und aktiviert so wiederum Liebe, Frieden und Harmonie in unserem gesamten Sein.
es: Amor, Paz y Armonía, un canto recibido por el Dr. y el Maestro Sha de la Divinidad, lleva la alta frecuencia y vibración del amor, el perdón, la compasión y la luz. Tu cuerpo resuena naturalmente con esta elevada frecuencia, y responde activando el amor, la paz y la armonía en todo tu ser.
fr: Amour, Paix et Harmonie, un chant reçu par le Dr et Maître Sha du Divin, porte la haute fréquence et la vibration de l’amour, du pardon, de la compassion et de la lumière. Votre corps résonne naturellement avec cette fréquence élevée, et réagit en activant l’amour, la paix et l’harmonie dans tout votre être.
nl: Liefde, Vrede en Harmonie, een lied ontvangen van de Goddelijke wereld door Dr en Master Sha, draagt de hoge frequentie en vibratie van liefde, vergeving, compassie en licht. Je lichaam resoneert van nature met deze verhoogde frequentie en reageert door liefde, vrede en harmonie te activeren in je hele wezen

source: By 2030, we hope to inspire 1.5 billion people to sing Love, Peace and Harmony for 15 minutes every day. Play and chant this song to create a world of love, peace and harmony.
de: Bis 2030 hoffen wir 1,5 Milliarden Menschen zu inspirieren, Liebe, Frieden und Harmonie für 15 Minuten täglich zu singen. Lassen Sie dieses Lied laufen und singen sie es, um Liebe, Frieden und Harmonie auf der Welt zu erschaffen.
es: Para 2030, esperamos inspirar a 1.500 millones de personas a cantar Amor, Paz y Armonía durante 15 minutos cada día. Toca y canta esta canción para crear un mundo de amor, paz y armonía.
fr: D’ici 2030, nous espérons inspirer 1,5 milliard de personnes à chanter Amour, Paix et Harmonie pendant 15 minutes chaque jour. Faites jouer et chantez ce chant pour créer un monde d’amour, de paix et d’harmonie.
nl: In 2030 hopen we 1,5 miljard mensen te inspireren om elke dag 15 minuten lang Liefde, Vrede en Harmonie te zingen. Speel en zing dit lied om een wereld van liefde, vrede en harmonie te creëren.

source: Together, we’ll celebrate the power of the human spirit and its ability to transcend, transform and triumph to create miracles. Imagine a world where everyone holds the message of love, peace and harmony.
de: Gemeinsam werden wir die Kraft der menschlichen Inspiration und ihrer Fähigkeit feiern, sich zu wandeln, zu transformieren und zu strahlen, was Wunder wirken kann. Stellen wir uns vor, dass alle Menschen die Botschaft von Liebe, Frieden und Harmonie in sich tragen.
es: Juntos, celebraremos el poder del espíritu humano y su capacidad de trascender, transformar y triunfar para crear milagros. Imagina un mundo donde todos tengan el mensaje de amor, paz y armonía.
fr: Ensemble, nous allons célébrer le pouvoir de l’esprit humain et sa capacité à transcender, transformer et triompher pour créer des miracles. Imaginez un monde où chacun détient le message d’amour, de paix et d’harmonie.
nl: Samen vieren we de kracht van de menselijke geest en diens vermogen om te verheffen, te transformeren en te zegevieren om wonderen te creëren. Stel je een wereld voor waar iedereen de boodschap van liefde, vrede en harmonie in zich draagt.

source: Love Peace Harmony Foundation was founded in 2006 and formally registered in the United States as a nonprofit in 2008. The mission of Love Peace Harmony Foundation is to offer assistance and support to various local and global humanitarian efforts. We strive to initiate and support projects that create happy, healthy, and peaceful families and communities. On a philosophical level, the Foundation’s mission is to serve all humanity and to make others happier and healthier. The goal is to raise the consciousness of humanity by chanting the Divine Soul Song Love, Peace and Harmony to uplift the frequency and vibration of Mother Earth and to improve humanity’s health and happiness by teaching of self-healing techniques.
de: Die Love Peace Harmony Foundation wurde 2006 gegründet und 2008 offiziell als gemeinnützige Organisation in den USA registriert. DieLove Peace Harmony Foundation hat sich zur Aufgabe gemacht, unterschiedliche humanitäre Bemühungen lokal wie global zu unterstützen und zu fördern. Wir streben an, Projekte ins Leben zu rufen und zu betreuen, damit glückliche, gesunde und friedvolle Familien und Gemeinschaften entstehen. Philosophisch betrachtet besteht die Aufgabe der Stiftung darin, der gesamten Menschheit zu dienen, um andere gesünder und glücklicher zu machen. Ziel ist es, das Bewusstsein der Menschheit anzuheben. Durch das Singen des heilsam wirkenden Liedes „Liebe, Frieden und Harmonie“ und das Vermitteln von Techniken zur Selbstheilung können die Frequenz und Schwingung von Mutter Erde erhöht, sowie die Gesundheit und Zufriedenheit verbessert werden .
es: La Fundación Amor Paz y Armonìa fue fundada en 2006 y registrada oficialmente en los Estados Unidos como organización sin fines de lucro en 2008. La misión de la Fundación Amor Paz y Armonìa es ofrecer asistencia y apoyo a diversas actividades humanitarias locales y mundiales. Nos esforzamos por iniciar y apoyar proyectos que creen familias y comunidades felices, saludables y pacíficas. A nivel filosófico, la misión de la Fundación es servir a toda la humanidad y hacer a otros más felices y saludables. El objetivo es elevar la conciencia de la humanidad cantando el Canto del Alma Divina Amor, Paz y Armonía para elevar la frecuencia y la vibración de la Madre Tierra y mejorar la salud y la felicidad de la humanidad mediante la enseñanza de técnicas de auto curación.
fr: La fondation Amour Paix Harmonie a été créée en 2006 et officiellement enregistrée aux États-Unis en tant qu’association à but non lucratif en 2008. La mission de la fondation Amour Paix Harmonie est d’offrir une assistance et un soutien à divers efforts humanitaires locaux et mondiaux. Nous nous efforçons de lancer et de soutenir des projets qui créent des familles et des communautés heureuses, saines et pacifiques. Sur le plan philosophique, la mission de la Fondation est de servir l’humanité tout entière et de rendre les gens plus heureux et en meilleure santé. Le but est d’élever la conscience de l’humanité en chantant le chant de l’âme du divin “Amour, Paix et Harmonie” pour élever la fréquence et la vibration de la Terre mère et pour améliorer la santé et le bonheur de l’humanité en enseignant des techniques d’autoguérison.
nl: Love Peace Harmony Foundation werd opgericht in 2006 en formeel geregistreerd in de Verenigde Staten als non-profit in 2008. De missie van Love Peace Harmony Foundation is om hulp en ondersteuning te bieden aan verschillende lokale en wereldwijde humanitaire inspanningen. Wij streven ernaar om projecten te initiëren en te ondersteunen die gelukkige, gezonde en vreedzame gezinnen en gemeenschappen creëren. Op filosofisch vlak is het de missie van de Stichting om de hele mensheid te dienen en anderen gelukkiger en gezonder te maken. Het doel is om het bewustzijn van de mensheid te verhogen door het Divine Soul Song (Goddelijke Zielenlied) “Liefde, Vrede en Harmonie” te zingen om de frequentie en vibratie van Moeder Aarde te verheffen en de gezondheid en het geluk van de mensheid te verbeteren door het onderwijzen van technieken voor zelfheling.
