Repository: casspangell/LPH-Mobile-App-iOS-Ron
Catalog: LovePeaceHarmony/*.lproj/Localizable.strings
Languages: de, es, fr, nl

source: Some of our numerous initiatives have included working with the Tarayana Foundation in Bhutan, a remote kingdom in the Himalayas. We are helping to support access to education, health care, and proper nutrition and creating a pilot project there that we hope will be replicated in many other areas of the world.
de: Eine unserer zahlreichen Initiativen ist beispielsweise die Zusammenarbeit mit der Tarayana Foundation in Bhutan, dem entlegenen Königreich im Himalaya. Wir unterstützen hier, um Bildung und richtige Ernährung zugänglich zu machen. Weiterhin starten wir dort mit einem Pilotprojekt, das wir dann hoffentlich in vielen Teilen der Welt ebenfalls durchführen werden.
es: Algunas de nuestras numerosas iniciativas han incluido el trabajo con la Fundación Tarayana en Bhután, un remoto reino en el Himalaya. Estamos ayudando a apoyar el acceso a la educación, la atención de la salud y la nutrición adecuada y creando un proyecto piloto allí que esperamos se reproduzca en muchas otras zonas del mundo.
fr: Parmi nos nombreuses initiatives, nous avons travaillé avec la Fondation Tarayana au Bhoutan, un royaume éloigné dans l’Himalaya. Nous aidons à soutenir l’accès à l’éducation, aux soins de santé et à une nutrition adéquate et nous y créons un projet pilote qui, nous l’espérons, sera reproduit dans de nombreuses autres régions du monde.
nl: Sommige van onze talrijke initiatieven omvatten het werken met de Tarayana Foundation in Bhutan, een afgelegen koninkrijk in de Himalaya. We helpen de toegang tot onderwijs, gezondheidszorg en goede voeding te ondersteunen en creëren daar een proefproject waarvan we hopen dat het in veel andere delen van de wereld zal worden overgenomen.

source: In Toronto, Canada, we have supported low-income families so they could send their children to the Harbourfront Centre summer camp to experience the many benefits of enjoying a variety of activities with their peers and engaging actively with the environment.
de: In Toronto, Kanada, unterstützten wir Familien mit niedrigem Einkommen, so dass sie ihre Kinder ins Ferienlager “Harbourfront Centre” schicken konnten, wo sie mit Gleichaltrigen viele Freizeitaktivitäten unternahmen und sich aktiv für die Umwelt einsetzten.
es: En Toronto (Canadá), hemos apoyado a familias de bajos ingresos para que pudieran enviar a sus hijos al campamento de verano del Harbourfront Centre para experimentar los muchos beneficios de disfrutar de una variedad de actividades con sus compañeros y participar activamente en el medio ambiente.
fr: À Toronto, au Canada, nous avons soutenu des familles à faible revenu afin qu’elles puissent envoyer leurs enfants au camp d’été du Harbourfront Centre pour qu’ils puissent profiter de nombreux avantages de la pratique de diverses activités avec leurs pairs et de leur engagement actif en faveur de l’environnement.
nl: In Toronto, Canada, hebben we gezinnen met een laag inkomen ondersteund, zodat ze hun kinderen naar het zomerkamp van het Harbourfront Centre konden sturen om de vele voordelen te ervaren van het genieten van een verscheidenheid aan activiteiten met hun leeftijdsgenoten en actief met het milieu bezig te zijn.

source: We have also contributed to the nonprofit WandAid to help families in earthquake damaged zones in Nepal. We are very honored to help support communities impacted by natural disasters, political crises, and other disadvantages.
de: Wir unterstützten die ebenfalls gemeinnützige Organisation WandAid, die nepalesischen Familien in zerstörten Erdbebengebieten hilft. Es freut uns sehr, Gemeinschaften zu helfen, die durch Naturkatastrophen, politische Krisen und andere Benachteiligungen benachteiligt sind.
es: También hemos contribuido a la organización sin fines de lucro WandAid para ayudar a las familias de las zonas dañadas por el terremoto en Nepal. Nos sentimos muy honrados de ayudar a las comunidades afectadas por desastres naturales, crisis políticas y otras desventajas
fr: Nous avons également contribué à l’organisation à but non lucratif WandAid pour aider les familles dans les zones endommagées par le tremblement de terre au Népal. Nous sommes très honorés de contribuer à soutenir les communautés touchées par les catastrophes naturelles, les crises politiques et autres désavantages.
nl: We hebben ook bijgedragen aan de non-profit WandAid om gezinnen te helpen in aardbevingsgebieden in Nepal. We zijn zeer vereerd om gemeenschappen te helpen ondersteunen die getroffen zijn door natuurrampen, politieke crises en andere tegenslagen.

source: Love Peace Harmony Foundation has numerous additional ongoing projects and is actively expanding efforts worldwide to help people live happier and healthier lives.
de: Die “Love Peace Harmony Foundation“ hat noch zahlreiche laufende Projekte und dehnt ihre Bemühungen weltweit aus Menschen zu helfen, ein gesünderes und glücklicheres Leben zu führen.
es: La Fundación Amor Paz y Armonìa tiene numerosos proyectos adicionales en curso y está ampliando activamente los esfuerzos en todo el mundo para ayudar a las personas a llevar una vida más feliz y saludable.
fr: La fondation Amour Paix Harmonie a de nombreux autres projets en cours et étend activement ses efforts dans le monde entier pour aider les gens à vivre plus heureux et en meilleure santé.
nl: Love Peace Harmony Foundation heeft tal van extra lopende projecten en breidt zich wereldwijd actief uit om te helpen mensen gelukkiger en gezonder te leven.

source: The Divine Soul Song Love, Peace and Harmony has been credited with many deeply transformative experiences by the people who have experienced it, lowering crime rates, incidences of physical abuse, and improving the health for women in low income homes in Mumbai, as well as increasing children’s intelligence and school performance. Chanting Love, Peace and Harmony for children in the slums of Mumbai (Dharavi, Asia’s largest slum) also resulted in greater emotional balance, happiness and other emotional benefits.
de: Das heilsam wirkende Lied „Liebe, Frieden und Harmonie“ hat vielen Menschen bereits nachweislich geholfen tiefgreifende Veränderungen zu erleben, wie sinkende Kriminalität und körperliche Gewalt, die gesundheitliche Verbesserung von Frauen in Haushalten mit niedrigen Einkommen in Mumbai, sowie die Erhöhung der Intelligenz und schulischen Leistungen von Kindern. Das Singen von „Liebe, Frieden und Harmonie“ von Kindern in dem Armenviertel von Mumbai (Dharavi, Asiens größtes Armenviertel) hat ebenso zu einer höheren emotionalen Ausgeglichenheit, Zufriedenheit und anderen emotionalen Verbesserungen geführt.
es: El canto del Alma Divina Amor, Paz y Armonía ha sido acreditado con muchas experiencias profundamente transformadoras por las personas que lo han experimentado, reduciendo las tasas de criminalidad, los incidentes de abuso físico y mejorando la salud de las mujeres en hogares de bajos ingresos en Mumbai, así como aumentando la inteligencia y el rendimiento escolar de los niños. Cantar Amor, Paz y Armonía para los niños de los barrios marginales de Mumbai (Dharavi, el barrio marginal más grande de Asia) también dio lugar a un mayor equilibrio emocional, felicidad y otros beneficios emocionales.
fr: Le chant divin Amour, Paix et Harmonie a été crédité de nombreuses expériences profondément transformatrices par les personnes qui l’ont vécue, en faisant baisser les taux de criminalité, les incidences d’abus physiques, et en améliorant la santé des femmes dans les foyers à faibles revenus de Mumbai, ainsi qu’en augmentant l’intelligence des enfants et leurs performances scolaires. Chanter l’amour, la paix et l’harmonie pour les enfants des bidonvilles de Mumbai (Dharavi, le plus grand bidonville d’Asie) a également permis d’améliorer l’équilibre émotionnel, le bonheur et d’autres avantages émotionnels.
nl: De Divine Soul Song Love, Peace and Harmony (het Zielenlied “Liefde, Vrede, Harmonie”) heeft bijgedragen aan vele diep transformerende ervaringen bij de mensen die het hebben ervaren, aan het verlagen van misdaadcijfers, het voorkomen van fysiek misbruik en het verbeteren van de gezondheid voor vrouwen met een laag inkomen in opvanghuizen in Mumbai, evenals het verhogen van de intelligentie van kinderen en van schoolprestaties. Het zingen van Love, Peace and Harmony voor kinderen in de sloppenwijken van Mumbai (Dharavi, de grootste sloppenwijk van Azie) resulteerde ook in een grotere emotionele balans, geluk en andere emotionele voordelen.

source: Dr. and Master Zhi Gang Sha is a world-renowned healer, Tao Grandmaster, philanthropist, humanitarian, and creator of Tao Calligraphy. He is the founder of Soul Mind Body Medicine™ and an eleven-time New York Times bestselling author of 24 books. An M.D. in China and a doctor of traditional Chinese medicine in China and Canada, Master Sha is the founder of Tao Academy™ and Love Peace Harmony Foundation™, which is dedicated to helping families worldwide create happier and healthier lives.
de: Dr. and Master Zhi Gang Sha ist ein weltweit bekannter Arzt und Heiler, ein Tao-Großmeister, Philanthropist, ein Menschenfreund und aus seinem Tao-Wissen inspirierter Kalligraf. Er begründete die “Seele Geist Körper Medizin“. Elf seiner insgesamt vierundzwanzig Bücher sind New York Times Bestseller geworden. In China und Kanada wurde er Arzt der westlichen und traditionellen chinesischen Medizin und gründete daraufhin die „Tao Academy™“ und die „Love Peace Harmony Foundation™“. Beide Unternehmen widmen ihr Wirken dahingehend Familien weltweit darin zu unterstützen, ein glücklicheres und gesünderes Leben zu führen.
es: El Dr. y Maestro Zhi Gang Sha es un sanador de renombre mundial, Gran Maestro del Tao, filántropo, humanitario y creador de la Caligrafía Tao. Es el fundador de Soul Mind Body Medicine™ y un autor de once bestsellers del New York Times de 24 libros. Doctor en medicina en China y doctor en medicina tradicional china en China y en Canadá, el Maestro Sha es el fundador de Tao Academy™ y la Fundación Amor Paz y Armonìa que se dedica a ayudar a las familias de todo el mundo a crear vidas más felices y saludables
fr: Dr et Maître Zhi Gang Sha est un guérisseur de renommée mondiale, Grand Maître du Tao, philanthrope, humanitaire et créateur de la Calligraphie du Tao. Il est le fondateur de Soul Mind Body Medicine™ (La médecine de l’âme, de l’esprit et du corps) et est l’auteur de 24 livres, dont onze sont repris sur la liste des meilleures ventes du New York Times. Médecin en Chine et docteur en médecine traditionnelle chinoise en Chine et au Canada, Maître Sha est le fondateur de la Tao Academy™ (l’Académie du Tao) et de la fondation Amour Paix Harmonie qui se consacre à aider les familles du monde entier à créer des vies plus heureuses et plus saines.
nl: Dr en Master Zhi Gang Sha is een wereldberoemde heler, Tao Grootmeester, filantroop, menslievend persoon en schepper van Tao Kalligrafie. Hij is de oprichter van Soul Mind Body Medicine™ en een elfvoudig New York Times bestseller auteur van 24 boeken. Een MD (arts) in China en een arts van de traditionele Chinese geneeskunde in China en Canada, Master Sha is de oprichter van Tao Academy™ en Love Peace Harmony Foundation™, die is gewijd aan het helpen van gezinnen wereldwijd om gelukkiger en gezonder leven te creëren.

source: A grandmaster of many ancient disciplines, including tai chi, qigong, kung fu, feng shui, and the I Ching, Master Sha was named Qigong Master of the Year at the Fifth World Congress on Qigong. In 2006, he was honored with the prestigious Martin Luther King, Jr. Commemorative Commission Award for his humanitarian efforts, and in 2016 Master Sha received rare and prestigious appointments as Shu Fa Jia (National Chinese Calligrapher Master) and Yan Jiu Yuan (Honorable Researcher Professor), the highest titles a Chinese calligrapher can receive, by the State Ethnic of Academy of Painting in China.
de: Als Großmeister vieler altehrwürdiger Disziplinen wie Tai Chi, Kung Fu und I Ging, wurde Master Sha auf dem 5. Weltkongress für Qi Gong zum „Qi Gong Meister des Jahres“ ernannt. 2006 erhielt er den begehrten Martin Luther King, Jr. Hall of Fame Award für hervorragende Leistungen zur Förderung von Frieden und Heilung. 2016 erhielt Master Sha die seltene und angesehene Ernennung zum Shu Fa Jia (Nationaler Chinesischer Kalligrafie-Meister) und Yan Jiu Yuan (Ehrenwerter Forschungsprofessor). Dies ist der höchste Titel für einen chinesischen Kalligrafen, der von der Staatlichen Ethnischen Akademie für Malerei in China verliehen wird.
es: Un gran maestro de muchas disciplinas antiguas, incluyendo el tai chi, el qigong, el kung fu, el feng shui y el I Ching, el Maestro Sha fue nombrado Maestro de Qigong del Año en el Quinto Congreso Mundial de Qigong. En 2006, fue honrado con el prestigioso Martin Luther King, Jr. Premio de la Comisión Conmemorativa por sus esfuerzos humanitarios, y en 2016 el Maestro Sha recibió los raros y prestigiosos nombramientos como Shu Fa Jia (Maestro Calígrafo Nacional Chino) y Yan Jiu Yuan (Profesor Investigador Honorario), los más altos títulos que un calígrafo chino puede recibir, por la Étnica Estatal de la Academia de Pintura de China.
fr: Grand maître de nombreuses disciplines anciennes, dont le tai-chi, le qi gong, le kung-fu, le feng shui et le I Ching, Maître Sha a été nommé Maître de Qi Gong de l’année lors du Fifth World Congress on Qigong (cinquième congrès mondial sur le Qigong). En 2006, il a été honoré du prestigieux prix Martin Luther King, Jr. Commemorative Commission Award (Prix de la Commission commémorative de Martin Luther King, Jr.) pour ses efforts humanitaires, et en 2016, Maître Sha a reçu les rares et prestigieuses nominations de Shu Fa Jia (Maître national de la calligraphie chinoise) et de Yan Jiu Yuan (Professeur chercheur honoraire), les plus hauts titres qu’un calligraphe chinois puisse recevoir, par l’Académie nationale ethnique de peinture en Chine.
nl: Een grootmeester van vele oude disciplines, waaronder Tai Chi, Qigong, Kung Fu, Feng Shui, en de I-Tjing. Master Sha werd uitgeroepen tot Qigong Master of the Year op het Vijfde Wereldcongres van Qigong. In 2006 werd hij geëerd met de prestigieuze Martin Luther King, Jr. Commemorative Commission Award voor zijn humanitaire inspanningen en in 2016 ontving Master Sha uitzonderlijke en prestigieuze benoemingen als Shu Fa Jia (National Chinese Calligrapher Master) en Yan Jiu Yuan (Honorable Researcher Professor), de hoogste titels die een Chinese kalligrafist kan ontvangen, door de State Ethnic Academy of Academy of Painting in China.

source: Master Sha was named Honorary Member of the Club of Budapest Foundation, an organization dedicated to resolving the social, political, economic, and ecological challenges of the twenty-first century. Officially launching in 2015, Master Sha has been invited to become one of the Founding Signatories of the Fuji Declaration, whose mission is to create lasting peace on Earth. Master Sha is a member of Rotary E-Club of World Peace and is a founding signatory of the Conscious Business Declaration, which aims to define a new standard for business in the twenty-first century that will increase economic prosperity while healing the environment and improving humanity’s well-being. In 2016, Master Sha received a Commendation from Los Angeles County for his humanitarian efforts both locally and worldwide, and a Commendation from the Hawaii Senate as a selfless humanitarian who celebrates the power of the human spirit as he travels the world tirelessly to create a Love Peace Harmony World Family. In 2017, he received the International Tara Award from Ven. Mae Chee Sansanee Sthirasuta of Sathira-Dhammasathan, for being a person who acts like a Boddhisattva, doing good for society. He continues to deliver free webcasts, teleconferences, and events that attract viewers and listeners from around the world.
de: Master Sha ist ein Ehrenmitglied der Club of Budapest Foundation, einer Organisation, die sich für die Lösung sozialer, politischer, wirtschaftlicher und ökologischer Herausforderungen im 21. Jahrhundert einsetzt. Master Sha erhielt die Einladung, einer der unterzeichnenden Gründer der “Fuji Declaration” bei ihrem offziellen Beginn in 2015 zu sein. Sie hat sich zur Aufgabe gemacht, dauerhaften Frieden auf der Erde zu schaffen. Master Sha ist ein Mitglied des “Rotary E-Club of World Peace”, sowie ein unterzeichnender Gründer der “Conscious Business Declaration”, die neue Richtlinien für die Wirtschaft des 21. Jahrhunderts festlegen möchte. Ziel ist es, die Wirtschaft zu fördern und gleichzeitig die Regeneration der Umwelt und des allgemeinen Wohlbefinden zu verbessern. 2016 erhielt Master Sha Auszeichnungen des Bezirks Los Angeles für seine humanitären Bemühungen, nicht nur auf lokaler, sondern auch auf weltweiter Ebene. Des weiteren erhielt er eine Auszeichnung vom Senat auf Hawaii für seine selbstlosen humanitären Bemühungen, weltweit die Kraft des menschlichen Geistes zu würdigen. Er setzte sich unermüdlich dafür ein, eine weltweite „Liebe, Frieden Harmonie Familie“ zu gründen. 2017 erhielt er den “Internationalen Tara Preis” durch Mae Chee Sansanee Sthirasuta in Sathira-Dhammasathan. Er erhielt diesen Preis dafür, dass er wie ein Boddhisattwa zum Wohle der Gesellschaft handelt. Er führt regelmäßige kostenfreie Online-Veranstaltungen durch, um Zuschauer- und Zuhörer(innen) auf der ganzen Welt anzusprechen.
es: El Maestro Sha fue nombrado Miembro Honorario de la Fundación del Club de Budapest, una organización dedicada a resolver los desafíos sociales, políticos, económicos y ecológicos del siglo XXI. Lanzado oficialmente en 2015, el Maestro Sha ha sido invitado a convertirse en uno de los Signatarios Fundadores de la Declaración de Fuji, cuya misión es crear paz duradera en la Tierra. El Maestro Sha es miembro del Ciberclub Rotario de la Paz Mundial y es uno de los signatarios fundadores de la Declaración de Negocios Conscientes, cuyo objetivo es definir un nuevo estándar para los negocios en el siglo XXI que aumente la prosperidad económica al mismo tiempo que sane el medio ambiente y mejore el bienestar de la humanidad. En 2016, el Maestro Sha recibió una Mención del Condado de Los Ángeles por sus esfuerzos humanitarios tanto a nivel local como mundial, y una Mención del Senado de Hawai como humanitario desinteresado que celebra el poder del espíritu humano mientras viaja incansablemente por el mundo para crear una Familia Mundial de Amor, Paz y Armonía. En 2017, recibió el Premio Internacional Tara de manos de la Venerable Mae Chee Sansanee Sthirasuta de Sathira-Dhammasathan, por ser una persona que actúa como un Bodhisattva, haciendo el bien a la sociedad. Continúa ofreciendo transmisiones gratuitas por Internet, teleconferencias y eventos que atraen a espectadores y oyentes de todo el mundo.
fr: Maître Sha a été nommé membre honoraire du Club de Budapest, une organisation qui se consacre à la résolution des défis sociaux, politiques, économiques et écologiques du XXIe siècle. Lancé officiellement en 2015, Master Sha a été invité à devenir l’un des signataires fondateurs de la Déclaration de Fuji, dont la mission est de créer une paix durable sur Terre. Maître Sha est membre du Rotary E-Club of World Peace et est l’un des signataires fondateurs de la Déclaration de l’Entreprise consciente, qui vise à définir une nouvelle norme pour les entreprises au XXIe siècle qui augmentera la prospérité économique tout en guérissant l’environnement et en améliorant le bien-être de l’humanité. En 2016, Maître Sha a reçu une citation du comté de Los Angeles pour ses efforts humanitaires tant au niveau local que mondial, ainsi qu’une citation du Sénat d’Hawaï en tant qu’humanitaire désintéressé qui célèbre la puissance de l’esprit humain alors qu’il parcourt inlassablement le monde pour créer une famille mondiale d’amour, de paix et d’harmonie. En 2017, il a reçu le International Tara Award (prix de Tara international) des mains de la Vénérable Mae Chee Sansanee Sthirasuta de Sathira-Dhammasathan, pour avoir agi comme un Boddhisattva, en faisant du bien à la société. Il continue à diffuser gratuitement des webdiffusions, des téléconférences et des événements qui attirent des téléspectateurs et des auditeurs du monde entier.
nl: Master Sha werd benoemd tot Erelid van de Club van Boedapest Foundation, een organisatie die zich inzet voor het oplossen van de sociale, politieke, economische en ecologische uitdagingen van de eenentwintigste eeuw. Master Sha was uitgenodigd als een van de oprichters ondertekenaars van de Fuji Verklaring, officieel gelanceerd in 2015, waarvan de missie is het creëren van duurzame vrede op aarde. Master Sha is lid van de Rotary E-Club of World Peace en is een van de mede oprichters ondertekenaars van de Conscious Business Declaration (Bewust Ondernemerschap Verklaring), die tot doel heeft om een nieuwe standaard voor het bedrijfsleven te definiëren in de eenentwintigste eeuw die de economische welvaart zal vergroten en tegelijkertijd het milieu te helen en het welzijn van de mensheid te verbeteren. In 2016 ontving Master Sha een eervolle vermelding van Los Angeles County voor zijn humanitaire inspanningen, zowel lokaal als wereldwijd, en een eervolle vermelding van de Senaat van Hawaï als een onbaatzuchtige humanitair die de kracht van de menselijke geest eert terwijl hij onvermoeibaar de wereld rondreist om een Love Peace Harmony World Family te creëren. In 2017 ontving hij de International Tara Award van Ven. Mae Chee Sansanee Sthirasuta van Sathira-Dhammasathan, omdat hij een persoon is die handelt als een Boddhisattva, die goed doet voor de samenleving. Hij blijft gratis webcasts, teleconferenties en evenementen aanbieden die kijkers en luisteraars van over de hele wereld aantrekken.

source: Email
es: Correo electrónico

source: Now playing:
de: Jetzt spielen:
nl: Speelt nu:

source: Instrumental
de: Instumental
nl: Instrumentaal

source: Ok
nl: Oké
